#! /usr/bin/env python3
################################################################################
#   currency.py
#
#   Currency game
#
#   08.12.2016  Created by: Rada Telyukova
################################################################################
 
import random

currency = {
    'США':       'доллар', 'Россия':   'рубль',  'Азербайджан': 'манат', 
    'Албания':   'лек',    'Монголия': 'тугрик', 'Молдавия':     'лей',
    'Германия':  'евро',   'Индия':    'рупия',  'Канада':       'доллар',
    'Израиль':   'шекель', 'Ирак':     'динар',  'Казахстан':    'тенге',
    'Аргентина': 'песо',   'Польша':   'злотый', 'Грузия':       'лари',
    'Китай':     'юань',   'Армения':  'драм',   'Корея':        'вона',
    'Швейцария': 'франк',  'Япония':   'йена',   'ЮАР':          'рэнд', 
    'Египет':    'фунт',   'Швеция':   'крона'
}
    
keys    = list(currency.keys())
random.shuffle(keys)
total   = 10
correct = 0

print('Введите валюту страны')

for i in range(0, total):
    key = keys[i]
    answer = input(key + ': ').strip().lower()
    if (answer == currency[key]):
        correct = correct + 1
        print('Правильно!')
    else:
        print('Неверно! Правильный ответ: ', currency[key])
        
if   (correct <  3): print ('\n"Молодец!" 2')
elif (correct <  5): print ('\n"Молодец!" 3')
elif (correct <  8): print ('\nХорошо! 4')
elif (correct < 10): print ('\nТы крут! 5')    
else:                print ('\nТЫ ГЕНИЙ!!! 5+')